7767517
165 175
Input            input.1                  0 1 input.1
Convolution      Conv_0                   1 1 input.1 322 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        BatchNormalization_1     1 1 322 323 0=32
Clip             Clip_2                   1 1 323 324 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_3                   1 1 324 325 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        BatchNormalization_4     1 1 325 326 0=32
Clip             Clip_5                   1 1 326 327 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_6                   1 1 327 328 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        BatchNormalization_7     1 1 328 329 0=16
Convolution      Conv_8                   1 1 329 330 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        BatchNormalization_9     1 1 330 331 0=96
Clip             Clip_10                  1 1 331 332 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_11                  1 1 332 333 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        BatchNormalization_12    1 1 333 334 0=96
Clip             Clip_13                  1 1 334 335 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_14                  1 1 335 336 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        BatchNormalization_15    1 1 336 337 0=24
Split            splitncnn_0              1 2 337 337_splitncnn_0 337_splitncnn_1
Convolution      Conv_16                  1 1 337_splitncnn_1 338 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        BatchNormalization_17    1 1 338 339 0=144
Clip             Clip_18                  1 1 339 340 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_19                  1 1 340 341 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        BatchNormalization_20    1 1 341 342 0=144
Clip             Clip_21                  1 1 342 343 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_22                  1 1 343 344 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        BatchNormalization_23    1 1 344 345 0=24
BinaryOp         Add_24                   2 1 337_splitncnn_0 345 346 0=0
Convolution      Conv_25                  1 1 346 347 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        BatchNormalization_26    1 1 347 348 0=144
Clip             Clip_27                  1 1 348 349 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_28                  1 1 349 350 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        BatchNormalization_29    1 1 350 351 0=144
Clip             Clip_30                  1 1 351 352 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_31                  1 1 352 353 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4608
BatchNorm        BatchNormalization_32    1 1 353 354 0=32
Split            splitncnn_1              1 2 354 354_splitncnn_0 354_splitncnn_1
Convolution      Conv_33                  1 1 354_splitncnn_1 355 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        BatchNormalization_34    1 1 355 356 0=192
Clip             Clip_35                  1 1 356 357 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_36                  1 1 357 358 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        BatchNormalization_37    1 1 358 359 0=192
Clip             Clip_38                  1 1 359 360 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_39                  1 1 360 361 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        BatchNormalization_40    1 1 361 362 0=32
BinaryOp         Add_41                   2 1 354_splitncnn_0 362 363 0=0
Split            splitncnn_2              1 2 363 363_splitncnn_0 363_splitncnn_1
Convolution      Conv_42                  1 1 363_splitncnn_1 364 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        BatchNormalization_43    1 1 364 365 0=192
Clip             Clip_44                  1 1 365 366 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_45                  1 1 366 367 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        BatchNormalization_46    1 1 367 368 0=192
Clip             Clip_47                  1 1 368 369 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_48                  1 1 369 370 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        BatchNormalization_49    1 1 370 371 0=32
BinaryOp         Add_50                   2 1 363_splitncnn_0 371 372 0=0
Convolution      Conv_51                  1 1 372 373 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        BatchNormalization_52    1 1 373 374 0=192
Clip             Clip_53                  1 1 374 375 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_54                  1 1 375 376 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        BatchNormalization_55    1 1 376 377 0=192
Clip             Clip_56                  1 1 377 378 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_57                  1 1 378 379 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12288
BatchNorm        BatchNormalization_58    1 1 379 380 0=64
Split            splitncnn_3              1 2 380 380_splitncnn_0 380_splitncnn_1
Convolution      Conv_59                  1 1 380_splitncnn_1 381 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        BatchNormalization_60    1 1 381 382 0=384
Clip             Clip_61                  1 1 382 383 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_62                  1 1 383 384 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        BatchNormalization_63    1 1 384 385 0=384
Clip             Clip_64                  1 1 385 386 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_65                  1 1 386 387 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        BatchNormalization_66    1 1 387 388 0=64
BinaryOp         Add_67                   2 1 380_splitncnn_0 388 389 0=0
Split            splitncnn_4              1 2 389 389_splitncnn_0 389_splitncnn_1
Convolution      Conv_68                  1 1 389_splitncnn_1 390 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        BatchNormalization_69    1 1 390 391 0=384
Clip             Clip_70                  1 1 391 392 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_71                  1 1 392 393 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        BatchNormalization_72    1 1 393 394 0=384
Clip             Clip_73                  1 1 394 395 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_74                  1 1 395 396 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        BatchNormalization_75    1 1 396 397 0=64
BinaryOp         Add_76                   2 1 389_splitncnn_0 397 398 0=0
Split            splitncnn_5              1 2 398 398_splitncnn_0 398_splitncnn_1
Convolution      Conv_77                  1 1 398_splitncnn_1 399 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        BatchNormalization_78    1 1 399 400 0=384
Clip             Clip_79                  1 1 400 401 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_80                  1 1 401 402 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        BatchNormalization_81    1 1 402 403 0=384
Clip             Clip_82                  1 1 403 404 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_83                  1 1 404 405 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        BatchNormalization_84    1 1 405 406 0=64
BinaryOp         Add_85                   2 1 398_splitncnn_0 406 407 0=0
Convolution      Conv_86                  1 1 407 408 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        BatchNormalization_87    1 1 408 409 0=384
Clip             Clip_88                  1 1 409 410 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_89                  1 1 410 411 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        BatchNormalization_90    1 1 411 412 0=384
Clip             Clip_91                  1 1 412 413 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_92                  1 1 413 414 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
BatchNorm        BatchNormalization_93    1 1 414 415 0=96
Split            splitncnn_6              1 2 415 415_splitncnn_0 415_splitncnn_1
Convolution      Conv_94                  1 1 415_splitncnn_1 416 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        BatchNormalization_95    1 1 416 417 0=576
Clip             Clip_96                  1 1 417 418 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_97                  1 1 418 419 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        BatchNormalization_98    1 1 419 420 0=576
Clip             Clip_99                  1 1 420 421 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_100                 1 1 421 422 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        BatchNormalization_101   1 1 422 423 0=96
BinaryOp         Add_102                  2 1 415_splitncnn_0 423 424 0=0
Split            splitncnn_7              1 2 424 424_splitncnn_0 424_splitncnn_1
Convolution      Conv_103                 1 1 424_splitncnn_1 425 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        BatchNormalization_104   1 1 425 426 0=576
Clip             Clip_105                 1 1 426 427 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_106                 1 1 427 428 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        BatchNormalization_107   1 1 428 429 0=576
Clip             Clip_108                 1 1 429 430 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_109                 1 1 430 431 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        BatchNormalization_110   1 1 431 432 0=96
BinaryOp         Add_111                  2 1 424_splitncnn_0 432 433 0=0
Convolution      Conv_112                 1 1 433 434 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        BatchNormalization_113   1 1 434 435 0=576
Clip             Clip_114                 1 1 435 436 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_115                 1 1 436 437 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        BatchNormalization_116   1 1 437 438 0=576
Clip             Clip_117                 1 1 438 439 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_118                 1 1 439 440 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=92160
BatchNorm        BatchNormalization_119   1 1 440 441 0=160
Split            splitncnn_8              1 2 441 441_splitncnn_0 441_splitncnn_1
Convolution      Conv_120                 1 1 441_splitncnn_1 442 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        BatchNormalization_121   1 1 442 443 0=960
Clip             Clip_122                 1 1 443 444 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_123                 1 1 444 445 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        BatchNormalization_124   1 1 445 446 0=960
Clip             Clip_125                 1 1 446 447 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_126                 1 1 447 448 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        BatchNormalization_127   1 1 448 449 0=160
BinaryOp         Add_128                  2 1 441_splitncnn_0 449 450 0=0
Split            splitncnn_9              1 2 450 450_splitncnn_0 450_splitncnn_1
Convolution      Conv_129                 1 1 450_splitncnn_1 451 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        BatchNormalization_130   1 1 451 452 0=960
Clip             Clip_131                 1 1 452 453 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_132                 1 1 453 454 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        BatchNormalization_133   1 1 454 455 0=960
Clip             Clip_134                 1 1 455 456 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_135                 1 1 456 457 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        BatchNormalization_136   1 1 457 458 0=160
BinaryOp         Add_137                  2 1 450_splitncnn_0 458 459 0=0
Convolution      Conv_138                 1 1 459 460 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        BatchNormalization_139   1 1 460 461 0=960
Clip             Clip_140                 1 1 461 462 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_141                 1 1 462 463 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        BatchNormalization_142   1 1 463 464 0=960
Clip             Clip_143                 1 1 464 465 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_144                 1 1 465 466 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=307200
BatchNorm        BatchNormalization_145   1 1 466 467 0=320
Convolution      Conv_146                 1 1 467 468 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=409600
BatchNorm        BatchNormalization_147   1 1 468 469 0=1280
Clip             Clip_148                 1 1 469 470 0=0.000000e+00 1=6.000000e+00
Pooling          GlobalAveragePool_149    1 1 470 471 0=1 4=1
Flatten          Flatten_150              1 1 471 472
InnerProduct     MatMul_151               1 1 472 474 0=1024 1=0 2=1310720
BatchNorm        BatchNormalization_152   1 1 474 475 0=1024
InnerProduct     MatMul_153               1 1 475 477 0=4066 1=0 2=4163584
